import React from 'react';

const Blogs = () => {
    return (
        <div className='m-20'>
            <h1 className='text-5xl mt-24'>প্রশ্নঃ Context API কী?</h1>
            <p className='text-xl mt-5'>যদি React JS এ এমন একটা কম্পোনেন্ট এ ডাটা পাঠাতে হয় যেটি আমার প্যারেন্ট কম্পোনেন্টের চাইল্ড না, তখন আমাদের root-component থেকে nth-component (যেই কম্পোনেন্ট এ ডাটা টা দরকার) সেই কম্পোনেন্ট পর্যন্ত multiple component পার হয়ে প্রপ্স এর মাধ্যমে ডাটা টা পাঠাতে হয়। এই প্রসেসটাকে বলে Props Drilling। কিন্তু সমস্যাটা হল প্রপ্সের মাধ্যমে ডাটা পাঠাতে হলে মাঝে এমন অনেক কম্পোনেন্ট থাকতে পারে যাদের আসলে এই ডাটা টা দরকার নেই, শুধু nth-child কে পাঠানোর জন্য তাকে প্রপ্স এর মাধ্যমে এই ডাটা টা নিতে হয়েছে। এই সমস্যা সমাধান করেছে Context API, এর মাধ্যমে ডাটাকে globally declare করে এবং প্রপ্স আকারে pass না করেই যেকোন কম্পোনেন্ট থেকে তাকে একসেস করে ব্যবহার করা যায়।  অর্থাৎ, কন্টেক্সট এপিআই দিয়ে props Drilling না করেই tree এর নিচের দিকের যে কোন চাইল্ড কম্পোনেন্টে তার উপর থেকে ডাটা পাঠানো যায়।</p>

            <h1 className='text-5xl mt-24'></h1>
        </div>
    );
};

export default Blogs;